tap "fsouza/prettierd"
tap "oven-sh/bun"

# system 
brew "cmake" if OS.mac?
# brew "coreutils" if OS.mac?
brew "neovim"
brew "fish"
brew "fisher"
brew "dash"
brew "stow"
brew "peco"
brew "ripgrep"
brew "readline"
brew "btop"
brew "tldr"
brew "grc"
brew "gnu-units"
brew "ast-grep"
brew "keychain"
brew "nixfmt"

# directories
brew "zoxide"
brew "eza"
brew "fd"
brew "fzf"
brew "lf"
brew "bat"
brew "broot"
brew "sk"

# utilities
brew "tmux" # terminal multiplexer
brew "xh" # for sending http requests
brew "dust" # disk space usage (non-interactive)
brew "dua-cli" # disk space usage (interactive)
brew "hyperfine" # benchmarking
brew "mprocs"
brew "cloc"
brew "uutils-coreutils"
brew "lynx"
brew "uv"
brew "azure-cli"

# git
brew "lazygit"
brew "git"
brew "git-delta"
brew "difftastic"
brew "gitui"

# development
brew "node"
brew "fnm" # node version manager
brew "corepack"
brew "fsouza/prettierd/prettierd"
brew "neovim"
brew "stylua"
brew "go"
brew "jq"
brew "luarocks"
brew "biome"
brew "deno"
brew "gum"
brew "docker"
brew "docker-buildx"
brew "rust"
brew "bacon"

# programs - mac
if OS.mac?
  brew "starship"
  cask "wezterm"
  cask "raycast"
  cask "numi"
  cask "font-noto-sans-runic"
  cask "rectangle"
  cask "bitwarden"
  cask "1password"
  cask "firefox"
  cask "floorp"
  cask "alt-tab"
  cask "replacicon"
  cask "cursor"
end
