tap "fsouza/prettierd"
tap "oven-sh/bun"

# system 
brew "cmake" if OS.mac?
brew "coreutils" if OS.mac?
brew "fish"
brew "fisher"
brew "stow"
brew "peco"
brew "ripgrep"
brew "readline"
brew "btop"
brew "tldr"
brew "grc"
brew "gnu-units"
brew "ast-grep"

# directories
brew "zoxide"
brew "eza"
brew "fd"
brew "fzf"
brew "lf"
brew "bat"
brew "broot"
brew "sk"

# development
brew "tmux"
brew "node@18"
brew "corepack"
brew "fsouza/prettierd/prettierd"
brew "cloc"
brew "neovim"
brew "stylua"
brew "lazygit"
brew "git"
brew "git-delta"
brew "go"
brew "jq"
brew "luarocks"
brew "rust"
brew "biome"
brew "difftastic"
brew "deno"

# programs - mac
if OS.mac?
  brew "starship"
  cask "wezterm"
  cask "raycast"
  cask "numi"
  cask "font-noto-sans-runic"
  cask "rectangle"
  cask "bitwarden"
  cask "1password"
  cask "firefox"
  cask "floorp"
  cask "alt-tab"
  cask "replacicon"
  cask "cursor"
end
