tap "homebrew/bundle"
tap "homebrew/cask"
tap "fsouza/prettierd"

cask "wezterm"

brew "fish"
brew "node@18"
brew "btop"
brew "bat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "readline"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "lf"
brew "lazygit"
brew "peco"
brew "lynx"
brew "neovim"
brew "yarn"
brew "ripgrep"
brew "stylua"
brew "stow"
brew "zoxide"
brew "ms-jpq/sad/sad"
brew "fsouza/prettierd/prettierd"
brew "fisher"
