tap "homebrew/bundle"
tap "homebrew/cask"
tap "fsouza/prettierd"
tap "oven-sh/bun"

# system 
brew "cmake" if OS.mac?
brew "coreutils" if OS.mac?
brew "fish"
brew "fisher"
brew "stow"
brew "peco"
brew "ripgrep"
brew "readline"
brew "btop"
brew "tldr"
brew "grc"
brew "gnu-units"

# directories
brew "zoxide"
brew "eza"
brew "fd"
brew "fzf"
brew "lf"
brew "bat"
brew "broot"
brew "sk"

# development
brew "tmux"
brew "node@18"
brew "corepack"
brew "fsouza/prettierd/prettierd"
brew "cloc"
brew "neovim"
brew "bun"
brew "stylua"
brew "ms-jpq/sad/sad"
brew "lazygit"
brew "git"
brew "git-delta"
brew "go"
brew "jq"
brew "luarocks"

# programs - mac
if OS.mac?
  cask "wezterm"
  cask "raycast"
  cask "numi"
end
